2013-10-02-Learning-Greek.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Learning Greek</title>
<!-- 2015-11-08 Sun 20:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ICECREAM(氷菓)" />
<meta  name="description" content="ICECREAM(氷菓)"
 />
<meta  name="keywords" content="language greek" />
<link rel="stylesheet" type="text/css" href="/static/style.css"/>


</head>
<body>
<div id="content">
<h1 class="title">Learning Greek</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">前言</a></li>
<li><a href="#sec-2">希腊文字:</a>
<ul>
<li><a href="#sec-2-1">如何在org-mode中输入希腊字母？</a></li>
<li><a href="#sec-2-2">在windows中输入希腊文</a></li>
<li><a href="#sec-2-3">How to type in Greek on a computer: Windwos and Mac</a></li>
<li><a href="#sec-2-4">Reference:</a></li>
</ul>
</li>
</ul>
</div>
</div>
---
layout: doc
title: Learning Greek
subtitle: 学习希腊语的笔记 
categories: note
tags: language greek
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">前言</h2>
<div class="outline-text-2" id="text-1">
<p>
这是一篇学习希腊文字的学习笔记，伴随着学习天文知识的进程而进行着。不定期更新。
这个让我想起来学习日文的那个烂摊子啊。不过终于跟着新日标将上下两层看完，接下来就是复习吧。
</p>

<p>
不过现在学习希腊文主要是服务学习天文知识的。
</p>

<p>
嗯，就是这个样子了。
</p>

<p>
然后，最新开始的就是装上Greek输入法啦。Windows用户可以使用系统自带的或者下载Google的输入法工具集。
</p>

<p>
然后就是等待我开始填坑啦。
</p>

<p>
刚刚搜索了一下学习Greek的网站，现在记录一下：
</p>
<ol class="org-ol">
<li><a href="http://www.xanthi.ilsp.gr/filog/">http://www.xanthi.ilsp.gr/filog/</a>
</li>
<li><a href="http://www.greece.org/gr-lessons/gr-english/">http://www.greece.org/gr-lessons/gr-english/</a>
</li>
<li><a href="http://a2z.fhl.net/bible/greek/greek.html">http://a2z.fhl.net/bible/greek/greek.html</a>
</li>
<li><a href="http://www.tukkk.com/greek/">http://www.tukkk.com/greek/</a>
</li>
</ol>

<p>
等待我的填坑吧……
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">希腊文字:</h2>
<div class="outline-text-2" id="text-2">
<p>
α β γ δ ε ζ η θ ι κ λ μ ν ξ ο π ρ σ τ υ φ χ ψ ω
暂时先这个样子吧，现在还不会，只是依葫芦画瓢而已。大家可以参考维基百科看看。
<a href="http://zh.wikipedia.org/wiki/%E5%B8%8C%E8%85%8A%E5%AD%97%E6%AF%8D">http://zh.wikipedia.org/wiki/%E5%B8%8C%E8%85%8A%E5%AD%97%E6%AF%8D</a>
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">如何在org-mode中输入希腊字母？</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
\alpha
\beta
\gamma
...
(\拉丁语)
</pre>

<p>
Reference:
</p>
<ol class="org-ol">
<li><a href="http://ergoemacs.org/emacs/emacs_n_unicode.html">http://ergoemacs.org/emacs/emacs_n_unicode.html</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">在windows中输入希腊文</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>使用ms自带的希腊文输入法
</li>
<li>去 <a href="http://www.google.com/inputtools/windows/">这里</a> 下载 Greek
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">How to type in Greek on a computer: Windwos and Mac</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="http://www.cambridgescp.com/downloads/typegreek.pdf">http://www.cambridgescp.com/downloads/typegreek.pdf</a>
</p>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Reference:</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>已故新約神學博士Dr.Degner，一口氣唸完全部24個字母。
<a href="http://a2z.fhl.net/bible/greek/Gclass1.html">http://a2z.fhl.net/bible/greek/Gclass1.html</a>
</li>
<li><a href="http://zh.wikipedia.org/wiki/%E5%B8%8C%E8%85%8A%E5%AD%97%E6%AF%8D">http://zh.wikipedia.org/wiki/%E5%B8%8C%E8%85%8A%E5%AD%97%E6%AF%8D</a>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<script src="/static/app.js"></script>
</div>
</body>
</html>
